## Assessment 1

***

### Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm
from statsmodels.formula.api import ols
import datetime
from datetime import datetime, timedelta
import scipy.stats
import pandas_profiling
from pandas_profiling import ProfileReport


%matplotlib inline
#sets the default autosave frequency in seconds
%autosave 60 
sns.set_style('dark')
sns.set(font_scale=1.2)

plt.rc('axes', titlesize=9)
plt.rc('axes', labelsize=14)
plt.rc('xtick', labelsize=12)
plt.rc('ytick', labelsize=12)

import warnings
warnings.filterwarnings('ignore')

# Use Folium library to plot values on a map.
#import folium

# Use Feature-Engine library
#import feature_engine
#import feature_engine.missing_data_imputers as mdi
#from feature_engine.outlier_removers import Winsorizer
#from feature_engine import categorical_encoders as ce
#from feature_engine.discretisation import EqualWidthDiscretiser, EqualFrequencyDiscretiser, DecisionTreeDiscretiser
#from feature_engine.encoding import OrdinalEncoder

pd.set_option('display.max_columns',None)
#pd.set_option('display.max_rows',None)
pd.set_option('display.width', 1000)
pd.option_context('float_format','{:.2f}'.format)

np.random.seed(0)
np.set_printoptions(suppress=True)

Autosaving every 60 seconds

In [2]:
df = pd.read_csv("heights.csv")

In [3]:
df

         sex     height
0       Male  75.000000
1       Male  70.000000
2       Male  68.000000
3       Male  74.000000
4       Male  61.000000
...      ...        ...
1045  Female  69.000000
1046    Male  69.000000
1047    Male  63.385827
1048    Male  66.000000
1049    Male  66.000000

[1050 rows x 2 columns]

Let's start by reviewing how to extract the variable names from a dataset using the names function. What are the two variable names used in the heights dataset?

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sex     1050 non-null   object
 1   height  1050 non-null   float64
dtypes: float64(1), object(1)
memory usage: 16.5+ KB

What data type is the sex variable?

Use the unique and length functions to determine how many unique heights were reported.

In [5]:
df.height.unique()

array([75.        , 70.        , 68.        , 74.        , 61.        ,
       65.        , 66.        , 62.        , 67.        , 72.        ,
       69.        , 64.        , 60.        , 73.        , 71.        ,
       66.75      , 63.        , 70.5       , 64.96062992, 64.1732    ,
       68.5       , 78.74015748, 69.6       , 66.5       , 71.5       ,
       76.        , 74.5       , 78.        , 62.5       , 77.        ,
       68.89      , 64.173     , 59.        , 67.7       , 71.7       ,
       70.87      , 68.11      , 64.57      , 51.        , 59.05511811,
       80.        , 64.96      , 68.8976378 , 69.68503937, 72.05      ,
       72.5       , 70.07874016, 53.        , 64.17322835, 59.0551    ,
       66.92      , 70.86614173, 74.8       , 68.4       , 69.3       ,
       66.53543307, 68.8976    , 61.81102362, 72.04724409, 67.72      ,
       72.4       , 79.05      , 63.77952756, 66.4       , 69.29      ,
       66.92913386, 66.1416    , 74.80314961, 72.44094488, 53.77      ,
       65.7480315 , 67.7165    , 54.        , 68.1102    , 64.961     ,
       67.71653543, 66.14173228, 70.8       , 77.1654    , 69.29133858,
       67.5       , 72.83      , 66.7       , 68.11023622, 68.50393701,
       67.78      , 67.71      , 79.        , 68.8       , 70.1       ,
       73.2       , 73.62      , 68.9       , 66.9       , 66.9291    ,
       70.85      , 72.44      , 61.32      , 66.93      , 58.        ,
       55.        , 73.22      , 66.1417    , 62.99212598, 70.08      ,
       67.2       , 72.45      , 75.98      , 75.59055118, 70.866     ,
       62.4       , 75.6       , 71.65      , 62.6       , 67.3       ,
       64.2       , 66.14      , 64.5       , 70.8661    , 75.4       ,
       72.8346    , 71.65354331, 64.56692913, 72.83464567, 78.74      ,
       64.9       , 59.84251969, 70.86      , 62.20472441, 68.11024   ,
       70.47244094, 52.        , 81.        , 62.5984252 , 82.67716535,
       50.        , 73.22834646, 63.38582677])

In [6]:
df.height.nunique()

138

Use the table function to compute the frequencies of each unique height value. Because we are using the resulting frequency table in a later exercise we want you to save the results into an object and call it tab

In [7]:
df.groupby("height").count()

           sex
height
50.000000    2
51.000000    1
52.000000    2
53.000000    1
53.770000    1
...        ...
79.000000    2
79.050000    1
80.000000    2
81.000000    1
82.677165    1

[138 rows x 1 columns]

In the previous exercise we computed the variable tab which reports the number of times each unique value appears. For values reported only once tab will be 1. Use logicals and the function sum to count the number of times this happens.

Since there are a finite number of reported heights and technically the height can be considered ordinal, which of the following is true:

Load the height data set and create a vector x with just the male heights:

In [8]:
df.head()

    sex  height
0  Male    75.0
1  Male    70.0
2  Male    68.0
3  Male    74.0
4  Male    61.0

In [9]:
male = df[df["sex"] == "Male"]

In [10]:
male

       sex     height
0     Male  75.000000
1     Male  70.000000
2     Male  68.000000
3     Male  74.000000
4     Male  61.000000
...    ...        ...
1044  Male  50.000000
1046  Male  69.000000
1047  Male  63.385827
1048  Male  66.000000
1049  Male  66.000000

[812 rows x 2 columns]

What proportion of the data is between 69 and 72 inches (taller than 69 but shorter or equal to 72)? A proportion is between 0 and 1.

In [11]:
male["yes"] = male["height"].apply(lambda x: 1 if 69.0<x<72.0 else 0)

In [12]:
male

       sex     height  yes
0     Male  75.000000    0
1     Male  70.000000    1
2     Male  68.000000    0
3     Male  74.000000    0
4     Male  61.000000    0
...    ...        ...  ...
1044  Male  50.000000    0
1046  Male  69.000000    0
1047  Male  63.385827    0
1048  Male  66.000000    0
1049  Male  66.000000    0

[812 rows x 3 columns]

In [13]:
male.yes.value_counts()

0    627
1    185
Name: yes, dtype: int64

In [14]:
185/812

0.22783251231527094

Use the normal approximation to estimate the proportion the proportion of the data that is between 69 and 72 inches.

Use normal approximation to estimate the proportion of heights between 79 and 81 inches and save it in an object called approx

Using the normal approximation, estimate the proportion of adult men that are taller than 7 feet, referred to as seven footers. Remember that 1 foot equals 12 inches.

Use your answer to the previous exercise to estimate the proportion of men that are seven feet tall or taller in the world and store that value as p

calculate the proportion of the world's 18 to 40 year old seven footers that are in the NBA.

Report the estimated proportion of people at least Lebron's height that are in the NBA.

### Assessment: Quantiles, percentiles, and boxplots

In [15]:
df

         sex     height
0       Male  75.000000
1       Male  70.000000
2       Male  68.000000
3       Male  74.000000
4       Male  61.000000
...      ...        ...
1045  Female  69.000000
1046    Male  69.000000
1047    Male  63.385827
1048    Male  66.000000
1049    Male  66.000000

[1050 rows x 2 columns]

Define a variable male that contains the male heights

Define a variable female that contains the female heights.

Report the length of each variable.

In [16]:
male = df[df["sex"] == "Male"]

In [17]:
female = df[df["sex"] == "Female"]

In [18]:
len(male), len(female)

(812, 238)

Create two five row vectors showing the 10th, 30th, 50th, 70th, and 90th percentiles for the heights of each sex called these vectors female_percentiles and male_percentiles

Then create a data frame called df with these two vectors as columns. The column names should be female and male and should appear in that order. As an example consider that if you want a data frame to have column names names and grades, in that order, you do it like this:

In [19]:
male.describe()

           height
count  812.000000
mean    69.314755
std      3.611024
min     50.000000
25%     67.000000
50%     69.000000
75%     72.000000
max     82.677165

In [20]:
np.percentile(male.height,10)

65.0

In [21]:
np.percentile(male.height,30)

68.0

In [22]:
np.percentile(male.height,50)

69.0

In [23]:
np.percentile(male.height,70)

71.0

In [24]:
np.percentile(male.height,90)

73.227511814

### Assessment: Robust Summaries with Outliers

Compute the average and median of these data. Note: do not assign them to a variable.

In [25]:
df2 = pd.read_csv("galton.csv")

In [26]:
df2

     parent  child
0      70.5   61.7
1      68.5   61.7
2      65.5   61.7
3      64.5   61.7
4      64.0   61.7
..      ...    ...
923    69.5   73.7
924    69.5   73.7
925    69.5   73.7
926    69.5   73.7
927    69.5   73.7

[928 rows x 2 columns]

In [27]:
df2.describe()

           parent       child
count  928.000000  928.000000
mean    68.308190   68.088470
std      1.787333    2.517941
min     64.000000   61.700000
25%     67.500000   66.200000
50%     68.500000   68.200000
75%     69.500000   70.200000
max     73.000000   73.700000

Compute the standard deviation and the median absolute deviation of these data.

Report how many inches the average grows after this mistake.

Report how many inches the SD grows after this mistake.

Report how many inches the median grows after the mistake.

Report how many inches the MAD grows after the mistake.

Write a function called error_avg that takes a value k and returns the average of the vector x after the first entry changed to k. Show the results for k=10000 and k=-10000.

#### Python code done by Dennis Lam